tap "facebook/fb"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss Army Knife for macOS
brew "m-cli"
# Polyglot runtime manager (Ruby, Node, Python, etc.)
brew "mise"
# Programmatically correct mistyped console commands
brew "thefuck"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Time tracking tool for agencies and freelancers
cask "clockify"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Disk usage utility
cask "disk-inventory-x"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Screen colour temperature controller
cask "flux-app"
# GIT client
cask "fork"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal built on web technologies
cask "hyper"
# Music discovery app
cask "ios-console"
# Keep your computer awake
cask "jiggler"
# Open-source keystroke visualiser
cask "keycastr"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Collaboration platform for API development
cask "postman"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Music streaming service
cask "spotify"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# OpenJDK distribution from Azul
cask "zulu@17"
vscode "be5invis.vscode-custom-css"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "infeng.vscode-react-typescript"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mhutchie.git-graph"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "nathanchapman.javascriptsnippets"
vscode "naumovs.color-highlight"
vscode "naumovs.theme-oceanicnext"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "tobiasalthoff.atom-material-theme"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
npm "corepack"
